your_alphabet = [
    'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м',
    'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ',
    'ы', 'ь', 'э', 'ю', 'я'
]
our_alphabet = [
    '4', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '_', '=', '+',
    '[', ']', '{', '}', ';', ':', '<', '>', '5', '0', '/', '7', '|',
    '~', '`', '§', '№', '¢', '€'
]

text = "{})#^:;:#<¢! {](%4}]#4-;€ ;] +[]- [4 (47)>}]#4[[]+ €(`_^"

decoced_text = ''

for i in text:
    if i != " " and i != "!":
        index_t = our_alphabet.index(i)
        decoced_text  += your_alphabet[index_t]

print(decoced_text )